; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-6)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	)
(:init
	(at plane1 city0)
	(= (capacity plane1) 11435)
	(= (fuel plane1) 728)
	(= (slow-burn plane1) 4)
	(= (fast-burn plane1) 13)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 10)
	(at plane2 city2)
	(= (capacity plane2) 9955)
	(= (fuel plane2) 2203)
	(= (slow-burn plane2) 4)
	(= (fast-burn plane2) 11)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 5)
	(at plane3 city2)
	(= (capacity plane3) 8708)
	(= (fuel plane3) 1620)
	(= (slow-burn plane3) 3)
	(= (fast-burn plane3) 7)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 7)
	(at plane4 city5)
	(= (capacity plane4) 2864)
	(= (fuel plane4) 730)
	(= (slow-burn plane4) 1)
	(= (fast-burn plane4) 3)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 9)
	(at plane5 city2)
	(= (capacity plane5) 12665)
	(= (fuel plane5) 353)
	(= (slow-burn plane5) 5)
	(= (fast-burn plane5) 15)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 1)
	(at person1 city5)
	(at person2 city4)
	(at person3 city5)
	(at person4 city4)
	(at person5 city2)
	(at person6 city5)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 850)
	(= (distance city0 city2) 935)
	(= (distance city0 city3) 948)
	(= (distance city0 city4) 763)
	(= (distance city0 city5) 961)
	(= (distance city1 city0) 850)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 705)
	(= (distance city1 city3) 756)
	(= (distance city1 city4) 729)
	(= (distance city1 city5) 867)
	(= (distance city2 city0) 935)
	(= (distance city2 city1) 705)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 646)
	(= (distance city2 city4) 807)
	(= (distance city2 city5) 604)
	(= (distance city3 city0) 948)
	(= (distance city3 city1) 756)
	(= (distance city3 city2) 646)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 957)
	(= (distance city3 city5) 884)
	(= (distance city4 city0) 763)
	(= (distance city4 city1) 729)
	(= (distance city4 city2) 807)
	(= (distance city4 city3) 957)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 713)
	(= (distance city5 city0) 961)
	(= (distance city5 city1) 867)
	(= (distance city5 city2) 604)
	(= (distance city5 city3) 884)
	(= (distance city5 city4) 713)
	(= (distance city5 city5) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city3)
	(at plane2 city4)
	(at plane3 city5)
	(at person2 city2)
	(at person3 city0)
	(at person4 city1)
	(at person5 city0)
	(at person6 city4)
	))

(:metric minimize (+ (* 1 (total-time))  (* 4 (total-fuel-used))))
)

; plan
1. (refuel plane3 city2)
   changed: (fuel plane3) from 1620 to 8708
   goals met: 0 of 8
2. (refuel plane2 city2)
   changed: (fuel plane2) from 2203 to 9955
   goals met: 0 of 8
3. (fly plane2 city2 city4)
   deleted: (at plane2 city2)
   added: (at plane2 city4)
   changed: (total-fuel-used) from 0 to 3228, (fuel plane2) from 9955 to 6727
   goals met: 1 of 8
4. (refuel plane1 city0)
   changed: (fuel plane1) from 728 to 11435
   goals met: 1 of 8
5. (fly plane1 city0 city3)
   deleted: (at plane1 city0)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 3228 to 7020, (fuel plane1) from 11435 to 7643
   goals met: 2 of 8
6. (board person2 plane2 city4)
   deleted: (at person2 city4)
   added: (in person2 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 2 of 8
7. (board person4 plane2 city4)
   deleted: (at person4 city4)
   added: (in person4 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 2 of 8
8. (zoom plane3 city2 city5)
   deleted: (at plane3 city2)
   added: (at plane3 city5)
   changed: (total-fuel-used) from 7020 to 11248, (fuel plane3) from 8708 to 4480
   goals met: 3 of 8
9. (board person3 plane3 city5)
   deleted: (at person3 city5)
   added: (in person3 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 3 of 8
10. (board person6 plane3 city5)
   deleted: (at person6 city5)
   added: (in person6 plane3)
   changed: (onboard plane3) from 1 to 2
   goals met: 3 of 8
11. (fly plane2 city4 city1)
   deleted: (at plane2 city4)
   added: (at plane2 city1)
   changed: (total-fuel-used) from 11248 to 14164, (fuel plane2) from 6727 to 3811
   goals met: 2 of 8
12. (debark person4 plane2 city1)
   deleted: (in person4 plane2)
   added: (at person4 city1)
   changed: (onboard plane2) from 2 to 1
   goals met: 3 of 8
13. (fly plane2 city1 city2)
   deleted: (at plane2 city1)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 14164 to 16984, (fuel plane2) from 3811 to 991
   goals met: 3 of 8
14. (debark person2 plane2 city2)
   deleted: (in person2 plane2)
   added: (at person2 city2)
   changed: (onboard plane2) from 1 to 0
   goals met: 4 of 8
15. (refuel plane2 city2)
   changed: (fuel plane2) from 991 to 9955
   goals met: 4 of 8
16. (board person5 plane2 city2)
   deleted: (at person5 city2)
   added: (in person5 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 4 of 8
17. (fly plane2 city2 city0)
   deleted: (at plane2 city2)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 16984 to 20724, (fuel plane2) from 9955 to 6215
   goals met: 4 of 8
18. (debark person5 plane2 city0)
   deleted: (in person5 plane2)
   added: (at person5 city0)
   changed: (onboard plane2) from 1 to 0
   goals met: 5 of 8
19. (fly plane2 city0 city4)
   deleted: (at plane2 city0)
   added: (at plane2 city4)
   changed: (total-fuel-used) from 20724 to 23776, (fuel plane2) from 6215 to 3163
   goals met: 6 of 8
20. (fly plane3 city5 city4)
   deleted: (at plane3 city5)
   added: (at plane3 city4)
   changed: (total-fuel-used) from 23776 to 25915, (fuel plane3) from 4480 to 2341
   goals met: 5 of 8
21. (debark person6 plane3 city4)
   deleted: (in person6 plane3)
   added: (at person6 city4)
   changed: (onboard plane3) from 2 to 1
   goals met: 6 of 8
22. (fly plane3 city4 city0)
   deleted: (at plane3 city4)
   added: (at plane3 city0)
   changed: (total-fuel-used) from 25915 to 28204, (fuel plane3) from 2341 to 52
   goals met: 6 of 8
23. (debark person3 plane3 city0)
   deleted: (in person3 plane3)
   added: (at person3 city0)
   changed: (onboard plane3) from 1 to 0
   goals met: 7 of 8
24. (refuel plane3 city0)
   changed: (fuel plane3) from 52 to 8708
   goals met: 7 of 8
25. (fly plane3 city0 city5)
   deleted: (at plane3 city0)
   added: (at plane3 city5)
   changed: (total-fuel-used) from 28204 to 31087, (fuel plane3) from 8708 to 5825
   goals met: 8 of 8
